from aiogram.utils.markdown import link, hlink

menu_main_text = '1. Погнали знакомиться o(>ω<)o \n' \
                 '2. Хочу поменять анкету (* ^ ω ^) \n' \
                 '3. Удалить анкету ＼(º □ º l|l)/'

my_form_text = '1. Переписать всё с нуля (・人・)\n' \
               '2. Изменить описание (* ^ ω ^)\n' \
               '3. Изменить фотокарточку ＼(≧▽≦)／\n' \
               '4. Да лан, всё и так каваи (＾▽＾)'

del_form = "Ваша анкета удалена!\n" \
           "Ты всегда можешь рассчитывать на меня. Просто нажми команду /start"

info = "Аригато! Я Акира - бот по поиску друзей и не только o(>ω<)o \n" \
       "Будьте здоровы, любите себя и своих близких (* ^ ω ^) \n " \
    # + link('Мы в телеграм', 'https://t.me/asiaparty')

ban = "1. Мне не отвечают взаимностью (＃＞＜)\n" \
      "2. Мошенничество и скам (＞ｍ＜)\n" \
      "3. Порно без цензурных пикселей (￢_￢;)\n" \
      "4. Забей, погнали дальше знакомиться o(>ω<)o"

admin_menu = "Что делать будем, семпай? ( ◡‿◡ *) \n" \
             "1. Банить негодяев ψ(▼へ▼メ)～→ \n" \
             "2. Вычисли по id (・人・) \n" \
             "3. Вычисли по username (・人・) \n" \
             "4. Потерять божий дар ＼(º □ º l|l)/"

warning_ban = "Сообщение от модератора:\n- Убедительно просим незамедлительно изменить свою анкету, она нарушает " \
              "требования нашего приложения " \
              "В ином случае мы направим к Вам Якудзу"

hello_text = "Меня зовут Акира, я помогу тебе найти кого хочешь"

delete_q = "Ты уверен, что хочешь покинуть нас? (μ_μ)"

no_found = "Мне не удалось найти пары для тебя (・人・)"

form = "Вот твоя анкета: "

set_gender = "Давай заполним анкету!\nДля начала выберите свой пол"

set_interest = "Кто тебя интересует?"

set_name = "Как меня тебя величать?"

set_age = "Damn, какое красивое имя (＾▽＾)"

set_city = "Из какого ты города?"

set_text = "Теперь расскажи немного о себе: чем занимаешься, откуда ты/национальность, кого ищещь и чем предалагаешь " \
           "заняться.\n(можешь оставить его пустым)"

liked = "Ура! Ты кому-то понравился (＾▽＾) жми /like "

like_list = "Твоя анкета понравилась данному пользователю:"

like_list_end = "На этом, к сожалению, всё (μ_μ)"

like_match = "У тебя произошел мэтч! "

ban_thq = "Спасибо, мы обязательно исправим ситуацию!"

notice = "Это совет от Акиры - как не стать жертвой мошенников? Будь осторожнее когда после знакомства:\n" \
         "- тебя просят прислать личные фотографии интимного характера.Их могут использовать против тебя.\n" \
         "- тебе прислали ссылку, в которой необходимо ввести личные данные.\n" \
         "- тебя просят одолжить денег или сделать покупку, например билеты в кино/театр.\n" \
         "- тебе предлагают выгодную сделку, платные, инвестиционные и другие услуги."
