from aiogram.utils.markdown import link, hlink

menu_main_text = '1. Погнали знакомиться o(>ω<)o \n' \
                 '2. Хочу поменять анкету (* ^ ω ^) \n' \
                 '3. Удалить анкету ＼(º □ º l|l)/'

my_form_text = '1. Переписать всё с нуля (・人・)\n' \
               '2. Изменить описание (* ^ ω ^)\n' \
               '3. Изменить фотокарточку ＼(≧▽≦)／\n' \
               '4. Погнали дальше знакомиться o(>ω<)o'

del_form = "Твоя анкета удалена!\n" \
           "Ты всегда можешь рассчитывать на меня. Просто нажми команду /start"

info = "Аригато! Я Акира - бот по поиску друзей и не только o(>ω<)o \n" \
       "Будьте здоровы, любите себя и своих близких (* ^ ω ^) \n " \
    # + link('Мы в телеграм', 'https://t.me/asiaparty')

ban = "1. Мошенничество и шантаж (＃＞＜)\n" \
      "2. Порно без цензурных пикселей (￢_￢;)\n" \
      "3. Передать личную жалобу модератору\n" \
      "4. Забей, погнали дальше знакомиться o(>ω<)o"

claim_text = "Напиши подробнее свою жалобу. Модераторы с ней однакомятся"

admin_menu = "Что делать будем, семпай? ( ◡‿◡ *) \n" \
             "1. Банить негодяев ψ(▼へ▼メ)～→ \n" \
             "2. Вычисли по id (・人・) \n" \
             "3. Вычисли по username (・人・) \n" \
             "4. Потерять божий дар ＼(º □ º l|l)/"

warning_ban = "Сообщение от модератора:\n- Убедительно просим незамедлительно изменить свою анкету, она нарушает " \
              "политику нашего приложения " \
              "В ином случае мы направим к Вам Якудзу"

hello_text = "Меня зовут Акира, я помогу тебе найти кого хочешь"

delete_q = "Ты уверен, что хочешь покинуть нас? (μ_μ)"

no_found = "Мне не удалось найти пары для тебя (・人・)"

form = "Вот твоя анкета: "

set_gender = "Давай заполним анкету!\nДля начала выберите свой пол"

set_interest = "Кто тебя интересует?"

set_name = "Как меня тебя звать?"

set_age = "Damn, какое красивое имя, "

set_city = "Из какого ты города?"

set_text = "Теперь расскажи немного о себе:\n" \
           "- чем занимаешься, увлечения\n" \
           "- откуда ты/национальность\n" \
           "- кого ищешь и чем предалагаешь заняться.\n\n(можешь оставить пустым)"

liked = "Ура! Ты кому-то понравился (＾▽＾)\nЗаканчивай с опросом сверху!"

check_liked = "сперва просмотри тех, кому понравилась твоя анкета!"

like_list = "Твоя анкета понравилась данному пользователю: \n\n"

like_list_end = "На этом, к сожалению, всё (μ_μ)"

like_match = "У тебя произошел мэтч! "

ban_thq = "Спасибо, мы обязательно исправим ситуацию!"

notice = "Это совет от Акиры - как не стать жертвой мошенников? Будь осторожнее когда после знакомства:\n" \
         "- тебя просят прислать личные фотографии интимного характера.Их могут использовать против тебя.\n" \
         "- тебе прислали ссылку, в которой необходимо ввести личные данные.\n" \
         "- тебя просят одолжить денег или сделать покупку, например билеты в кино/театр.\n" \
         "- тебе предлагают выгодную сделку, платные, инвестиционные и другие услуги."

instruction = "Небольшая инструкция по боту. Я буду присылать тебе анкеты, твоя задача - реагировать на них:\n" \
              "❤️ - понравился человечек\n" \
              "👎 - не понравился человечек\n" \
              "🚫 - подать жалобу на человека\n\n" \
              "Если тот, кого ты лайкнул ответит взаимностью - тебе придет сообщение!\n\n" \
              "(Анкеты могут повторяться из-за маленькой базы, приложение только набирает обороты)"

ad = ["А ты в курсе про наши <a href='https://t.me/asiaparty'>азиатские вечеринки</a> в Москве? Тусим каждую субботу, не пропусти",
      "В эту субботу город заснет и только настоящие тусеры застанут <a href='https://t.me/asiaparty'>АЗИЯ ПАТИ</a>!",
      "Больше, чем просто азиатские вечеринки в Москве - <a href='https://t.me/asiaparty'>ASIAN KINGS</a>. Ждем тебя каждую субботу!",
      "Вливайся в семью <a href='https://t.me/asiaparty'>ASIAN KINGS</a> - где каждую субботу проводят бомбезные вечеринки в центре Москвы!",
      "<a href='https://t.me/asiaparty'>ASIAN KINGS</a> - единство наций и дружба народов на одном танцполе каждую субботу!",
      "<a href='https://t.me/asiaparty'>ASIAN KINGS</a> - там, где все свои!",
      "Damn, тебе сегодня повезло! Ты получил бесплатную проходку на <a href='https://t.me/asiaparty'>ASIAN KINGS</a> в эту субботу, "
      "просто покажи переписку на входе!",
      "Знакомьтесь, листайте мемчики и приходите на вечеринки от <a href='https://t.me/asiaparty'>Asian Kings</a>!"
      ]
