from aiogram.utils.markdown import link as link

menu_main_text = '1. Смотреть анкеты\n' \
                 '2. Редактировать мою анкету\n' \
                 '3. Удалить анкету'

my_form_text = '1. Заполнить анкету заново\n' \
               '2. Изменить текст анкеты\n' \
               '3. Изменить фото\n' \
               '4. Вернуться назад'

del_form = "Ваша анкета удалена!\n" \
           "Вы можете вернуться сюда в любое время по команде /start"

info = "псевдобот для поиска псевдоотношений и псевдодрузей.\n" \
       "Будьте здоровы, любите себя и своих близких"
ban = "1. Игнор\n" \
      "2. Мошенничество\n" \
      "3. Материал 18+\n" \
      "4. Продолжить смотреть анкеты"

admin_menu = "Ну че, всевышний, че делать будем?\n" \
             "1. Пойду банить негодяев\n" \
             "2. Найти кое-кого по id\n" \
             "3. Найти кое-кого по username\n" \
             "4. Вернуться в главное меню"

warning_ban = "Убедительно просим незамедлительно изменить свою анкету, она нарушает требования нашего приложения\n" \
              "В ином случае функции пользования ботом будут ограничены"

hello_text = "Меня зовут Акира, я помогу тебе найти кого хочешь"

delete_q = "Вы уверены, что хотите удалить свою анкету?"

no_found = "Мне не удалось подобрать вам никого"

form = "Вот ваша анкета: "

set_gender = "Давайте заполним анкету!\nДля начала выберите свой пол"

set_interest = "Кто вас интересует?"

set_name = "Введите своё имя"

set_age = "Сколько вам лет?"

set_city = "Напишите свой город"

set_text = "Введите описание анкеты (вы можете оставить его пустым)"

liked = "Вы понравились кому-то. жми /like "

like_list = "Вы понравились данному пользователю:"

like_list_end = "Вы уже просмотрели всех, кому понравилась ваша анкета"

like_match = "У вас произошел мэтч!: "

ban_thq = "Спасибо, мы обязательно учтем ваше замечание!"
